[
  {
    "post_title": "Call with Rhea last night.",
    "url": "https://keshav.wtf/diary/call-with-rhea-last-night",
    "created_date": "Mon Dec 05 2022 16:50:49 GMT+0000 (Coordinated Universal Time)",
    "note": "I was getting ready to go to bed last night before Rhea called around 10:20 PM. I called her around 4 PM yesterday after Motu passed away, but she didn't pick up and I felt so lonely at the moment because I didn't feel like I had any emotional support from my friends. Well, we spoke until midnight about everything that happened, and I wanted to share some bits and pieces.\n\nIn May, her dog, Taz, passed away, and she tried calling me when I was in DC with Kevin, but I didn't pick up. So I called her in hopes that she would understand the pain that I was going through. And honestly, it was good to chat with her because it made me feel less lonely in the process. She is quite spiritual (unlike me), and she mentioned how she coped with the death of Taz by imagining his spirit going into heaven and that he now has become her spiritual guide whenever she needs to make an important decision. While I don't fully believe this thinking, I can see how and why people believe in things like this. Even my mom and Steffi yesterday said how Motu is now in heaven—what it does is that it gives people a reason to feel supported and make sense of things. That there is this almighty God looking down, all-knowing, there for you. I can see how religion becomes a coping mechanism for people who have lost a loved one because it makes them hopeful that they will, one day, be reconnected to the ones they lost.\n\nAnyhow, just seeing Rhea and having someone there for me was all I needed—I felt cared for, my emotions felt seen, and I was incredibly grateful to have a friend like her at that moment in time. And in the middle of our call, she asked me what my comfort food was, and I said fried chicken, Butter Chicken, Pad-Sew-Ew, and tacos, and she had fried chicken delivered to my door. Even though it came at midnight and was highly processed, it's the thought that counts that made me feel loved. I know we're strictly friends, but she might as well be my girlfriend at this point. Anyway, after that, we finalized our trip to upstate New York that we wanted to do from December 16th through the 18th. We booked an Airbnb that I really wanted to get, and it's going to be just us two, going upstate, spending a weekend together, in the middle of the woods, by ourselves. I know it will be an intimate getaway, so I want to make the best of it. The drive is about 1.5-2.5 hours away, so it'll be like a mini road trip, and we might drive even further up north since we have a car. We want this to be sort of like an escape from the concrete jungle that Manhattan is, so we're planning to do things like meditating, stargazing, yoga, tai chi, deep conversations, journaling, etc.\n\nAll that said, I am excited about this upcoming trip because I know I really need it. I am heading back home for my parents' 29th anniversary this Friday, so it'll be nice to spend some time with family and then with Rhea before Christmas. Despite the sadness I am experiencing, I am excited about things coming up because life goes on, one way or another.",
    "tags": "rhea; grateful; motu; nyc; parents; sprituality; emotions; steffi"
  }
]